import datetime
from datetime import date, datetime
from decimal import Decimal
from enum import Enum
from typing import BinaryIO, List

from opentaxkr.models import 납세자, 세무대리인
from opentaxkr.ers import ERSReport, ERSRecord
from opentaxkr.ers.report import 전자신고서식


class 양도소득세신고서식(전자신고서식):
    module = '양도소득세'
    report_date_field = '작성일자'

    def extract_기준일자(self, data: BinaryIO):
        return datetime.strptime(self.extract_field(
            self.find_field('TI01_양도소득세과세표준신고서_HEADER', self.report_date_field), data
        ),'%Y%m%d').date()

    @staticmethod
    def 주택임대사업자_업종코드():
        return [701101, 701102, 701103, 701104, 701301]

    def filename(self, first_record):
        return f"{date.today().strftime('%Y%m%d')}{first_record['서식코드']}.{first_record.get('세목구분코드')}"


양도소득세신고서식.load_histories()


class 양도소득세신고(ERSReport):
    format_class = 양도소득세신고서식
    report_date_field = '과세기간_년월'

    def __init__(self, 납세자_obj, 과세기간: date, 세무대리인_obj: 세무대리인 = None, 작성일자: date = None, 제출일자: date = None):
        self.납세자 = 납세자_obj
        self.과세기간 = 과세기간
        self.세무대리인 = 세무대리인_obj
        self.작성일자 = 작성일자 or date.today()
        self.제출일자 = 제출일자 or 작성일자 or date.today()
        super().__init__()

    @classmethod
    def records_module(cls):
        from opentaxkr.ers.양도소득세 import records_20230502
        return records_20230502

    def calculate(self):
        pass


class 양도소득_과세구분(Enum):
    비과세 = '01'
    과세제외 = '05'
    과세 = 'ZZ'


class 자산의종류(Enum):
    비상장주식_중소기업외법인대주주1년미만보유주식_ = '09'
    비상장주식_중소기업외_2018귀속_이후_대주주제외_국외주식_기타_ = '10'
    비상장주식_중소기업_2016귀속_이후는_대주주가_아닌_자가_양도하는_경우_국외주식_중소기업 = '11'
    비상장주식_중소기업외법인대주주_1년이상_보유주식_2018귀속_이후 = '21'
    상장주식_중소기업외법인대주주1년미만보유주식 = '12'
    상장주식_기타_대주주_2016귀속_이후_중소기업은_대주주가_아닌자가_양도하는_경우_2018귀속_이후_대주주제외 = '13'
    비상장주식_중소기업_대주주_2016년이후_양도분부터_적용 = '18'
    상장주식_중소기업_대주주_2016년_이후_양도분부터_적용 = '19'
    상장주식_중소기업외법인대주주_1년이상_보유주식_2018귀속_이후 = '22'


class 주식종류코드(Enum):
    비상장주식_중소기업_소액주주 = '31'
    비상장주식_중소기업_대주주 = '34'
    비상장주식_중소기업외_법인_소액주주 = '32'
    비상장주식_중소기업외_법인_대주주 = '35'
    비상장주식_중소기업외_법인_대주주_1년미만 = '33'
    상장주식_중소기업_소액주주_코스피 = '43'
    상장주식_중소기업_소액주주_코스닥 = '21'
    상장주식_중소기업_소액주주_코넥스 = '71'
    상장주식_중소기업_대주주_코스피 = '44'
    상장주식_중소기업_대주주_코스닥 = '24'
    상장주식_중소기업_대주주_코넥스 = '74'
    상장주식_중소기업외_법인_소액주주_코스피 = '42'
    상장주식_중소기업외_법인_소액주주_코스닥 = '22'
    상장주식_중소기업외_법인_대주주_코스피 = '45'
    상장주식_중소기업외_법인_대주주_코스닥 = '45'
    상장주식_중소기업외_법인_대주주_1년미만_코스피 = '41'
    상장주식_중소기업외_법인_대주주_1년미만_코스닥 = '23'
    기타자산_주식등양도분 = '51'
    기타자산_주식등양도분_비사업용토지 = '52'
    국외주식등_중소기업 = '62'
    국외주식등_중소기업외법인 = '61'

    @property
    def 세율구분(self) -> '주식양도세율구분':
        return [세율구분 for 세율구분 in 양도세율구분 if self in 세율구분.주식종류_list][0]


class 취득유형(Enum):
    매매 = '01'
    공모 = '02'
    유상증자 = '03'
    무상증자 = '04'
    지식배당 = '05'
    합병 = '06'
    증여 = '07'
    상속 = '08'
    출자 = '10'
    기타 = '09'


class 주식양도세율구분:
    def __init__(self, text: str, 세율: Decimal, *주식종류_list: 주식종류코드):
        self.value = text
        self.세율 = 세율
        self.주식종류_list = 주식종류_list


class 양도세율구분(Enum):
    중소기업외_법인_소액주주_국내주식_중소기업외_법인_국외주식 = ('61', Decimal(20),
                                                주식종류코드.국외주식등_중소기업외법인,
                                                주식종류코드.상장주식_중소기업외_법인_소액주주_코스닥,
                                                주식종류코드.비상장주식_중소기업외_법인_소액주주,
                                                주식종류코드.상장주식_중소기업외_법인_소액주주_코스피)
    중소기업_법인_소액주주_국내주식_중소기업_법인_국외주식 = ('62', Decimal(10),
                                              주식종류코드.국외주식등_중소기업,
                                              주식종류코드.상장주식_중소기업_소액주주_코스닥,
                                              주식종류코드.비상장주식_중소기업_소액주주,
                                              주식종류코드.상장주식_중소기업_소액주주_코스피,
                                              주식종류코드.상장주식_중소기업_소액주주_코넥스)
    중소기업외_법인의_대주주가_1년_미만_보유한_국내주식 = ('70', Decimal(30),
                                             주식종류코드.상장주식_중소기업외_법인_대주주_1년미만_코스닥,
                                             주식종류코드.비상장주식_중소기업외_법인_대주주_1년미만,
                                             주식종류코드.상장주식_중소기업외_법인_대주주_1년미만_코스피,
                                             # TODO 73이 주식종류코드에 없다.
                                             )
    중소기업법인의_대주주가_1년_이상_보유한_국내주식 = ('63', Decimal(20),
                                           주식종류코드.상장주식_중소기업_대주주_코스닥,
                                           # TODO 25
                                           주식종류코드.비상장주식_중소기업_대주주,
                                           주식종류코드.비상장주식_중소기업외_법인_대주주,
                                           주식종류코드.상장주식_중소기업_대주주_코스피,
                                           주식종류코드.상장주식_중소기업_대주주_코넥스)

    def __init__(self, text: str, 세율: Decimal, *주식종류_list: 주식종류코드):
        self.세율 = 세율
        self.주식종류_list = 주식종류_list
